app/controllers/api/boards_controller.rb

INSERT INTO "boards" ("title", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test board"], ["author_id", 2], ["created_at", "2021-04-14 11:37:38.723111"], ["updated_at", "2021-04-14 11:37:38.723111"]]
---
    def create
        @board = Board.new(board_params)
        @board.author_id = current_user.id
        if @board.save

SELECT "boards".* FROM "boards" WHERE "boards"."author_id" = $1  [["author_id", 2]]
---
    def index
        @boards = Board.where(author_id: params[:user_id])