app/controllers/api/lists_controller.rb

INSERT INTO "lists" ("title", "author_id", "board_id", "board_pos", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Test1"], ["author_id", 2], ["board_id", 1], ["board_pos", 1], ["created_at", "2021-04-16 07:57:23.029136"], ["updated_at", "2021-04-16 07:57:23.029136"]]
---
    def create
        @list = List.new(list_params)
        @list.author_id = current_user.id
        if @list.save

SELECT "lists".* FROM "lists" WHERE "lists"."board_id" = $1  [["board_id", 1]]
---
    def index
        @lists = List.where(board_id: params[:boardId])